devdnl/dnx-rtos/src/system/drivers/i2c/drv/STM32F3F7/i2c_lld.c
/*=========================================================================*//**
@file    i2c_lld.c

@author  Daniel Zorychta

@brief   This driver support I2C peripherals.

@note    Copyright (C) 2020  Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "i2c_cfg.h"
#include "drivers/driver.h"
#include "gpio_ddi.h"
#include "i2c.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define I2C_TRANSFER_TIMEOUT            2000
#define MAX_TRANSFER_SIZE               255
#define NSEC_PER_SEC                    1000000000ULL
#define PRESC_MAX                       16
#define SCLDEL_MAX                      16
#define SDADEL_MAX                      16
#define SCLH_MAX                        256
#define SCLL_MAX                        256

/*
 * Divide positive or negative dividend by positive or negative divisor
 * and round to closest integer. Result is undefined for negative
 * divisors if the dividend variable type is unsigned and for negative
 * dividends if the divisor variable type is unsigned.
 */
#define DIV_ROUND_CLOSEST(x, divisor)(                  \
{                                                       \
        __typeof__(x) __x = x;                          \
        __typeof__(divisor) __d = divisor;              \
        (((__typeof__(x))-1) > 0 ||                     \
         ((__typeof__(divisor))-1) > 0 ||               \
         (((__x) > 0) == ((__d) > 0))) ?                \
                (((__x) + ((__d) / 2)) / (__d)) :       \
                (((__x) - ((__d) / 2)) / (__d));        \
}                                                       \
)                                                       \


/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/// type defines configuration of single I2C peripheral
typedef struct {
        const I2C_TypeDef      *const I2C;            //!< pointer to the I2C peripheral
        const u32_t             scl_freq;             //!< peripheral SCL frequency [Hz]
        const u32_t             filter;               //!< filters mask
        const u16_t             scl_rise_time_ns;     //!< SCL rise time
        const u16_t             scl_fall_time_ns;     //!< SCL fall time
        const u16_t             data_hold_time_ns;    //!< Data hold time, (tHD:DAT), delay SCL low to data change
        const u16_t             data_setup_time_ns;   //!< Data setup time, (tSU:DAT), delay data setup to SCL high
        const u32_t             APB1ENR_I2CEN;        //!< mask used to enable I2C clock in the APB1ENR register
        const u32_t             APB1RSTR_I2CRST;      //!< mask used to reset I2C in the APB1RSTR register
        const IRQn_Type         IRQ_EV_n;             //!< number of event IRQ vector
        const IRQn_Type         IRQ_ER_n;             //!< number of error IRQ vector
        const u32_t             IRQ_priority;         //!< IRQ priority
        const u32_t             clk_src;              //!< I2C Clock source
} I2C_info_t;

/**
 * I2C timing results fields
 */
typedef struct {
        u32_t PRESC;
        u32_t SCLDEL;
        u32_t SDADEL;
        u32_t SCLH;
        u32_t SCLL;
} i2c_timing_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static inline I2C_TypeDef *get_I2C(I2C_dev_t *hdl);
static void IRQ_EV_handler(u8_t major);
static void IRQ_ER_handler(u8_t major);

/*==============================================================================
  Local object definitions
==============================================================================*/
MODULE_NAME(I2C);

// peripherals configuration
static const I2C_info_t I2C_HW[_I2C_NUMBER_OF_PERIPHERALS] = {
        #if defined(RCC_APB1ENR_I2C1EN)
        {
                .I2C               = (I2C_TypeDef*)I2C1,
                .scl_freq          = __I2C1_SCL_FREQ__,
                .filter            = __I2C1_ANALOG_FILTER_DISABLE__ | ((__I2C1_DIGITAL_FILTER__ << I2C_CR1_DNF_Pos) & I2C_CR1_DNF),
                .scl_rise_time_ns  = __I2C1_SCL_RISE_TIME_ns__,
                .scl_fall_time_ns  = __I2C1_SCL_FALL_TIME_ns__,
                .data_hold_time_ns = __I2C1_DATA_HOLD_TIME_ns__,
                .data_setup_time_ns= __I2C1_DATA_SETUP_TIME_ns__,
                .APB1ENR_I2CEN     = RCC_APB1ENR_I2C1EN,
                .APB1RSTR_I2CRST   = RCC_APB1RSTR_I2C1RST,
                .IRQ_EV_n          = I2C1_EV_IRQn,
                .IRQ_ER_n          = I2C1_ER_IRQn,
                .clk_src           = LL_RCC_I2C1_CLKSOURCE
        },
        #endif
        #if defined(RCC_APB1ENR_I2C2EN)
        {
                .I2C               = (I2C_TypeDef*)I2C2,
                .scl_freq          = __I2C2_SCL_FREQ__,
                .filter            = __I2C2_ANALOG_FILTER_DISABLE__ | ((__I2C2_DIGITAL_FILTER__ << I2C_CR1_DNF_Pos) & I2C_CR1_DNF),
                .scl_rise_time_ns  = __I2C2_SCL_RISE_TIME_ns__,
                .scl_fall_time_ns  = __I2C2_SCL_FALL_TIME_ns__,
                .data_hold_time_ns = __I2C2_DATA_HOLD_TIME_ns__,
                .data_setup_time_ns= __I2C2_DATA_SETUP_TIME_ns__,
                .APB1ENR_I2CEN     = RCC_APB1ENR_I2C2EN,
                .APB1RSTR_I2CRST   = RCC_APB1RSTR_I2C2RST,
                .IRQ_EV_n          = I2C2_EV_IRQn,
                .IRQ_ER_n          = I2C2_ER_IRQn,
                .clk_src           = LL_RCC_I2C2_CLKSOURCE
        },
        #endif
        #if defined(RCC_APB1ENR_I2C3EN)
        {
                .I2C               = (I2C_TypeDef*)I2C3,
                .scl_freq          = __I2C3_SCL_FREQ__,
                .filter            = __I2C3_ANALOG_FILTER_DISABLE__ | ((__I2C3_DIGITAL_FILTER__ << I2C_CR1_DNF_Pos) & I2C_CR1_DNF),
                .scl_rise_time_ns  = __I2C3_SCL_RISE_TIME_ns__,
                .scl_fall_time_ns  = __I2C3_SCL_FALL_TIME_ns__,
                .data_hold_time_ns = __I2C3_DATA_HOLD_TIME_ns__,
                .data_setup_time_ns= __I2C3_DATA_SETUP_TIME_ns__,
                .APB1ENR_I2CEN     = RCC_APB1ENR_I2C3EN,
                .APB1RSTR_I2CRST   = RCC_APB1RSTR_I2C3RST,
                .IRQ_EV_n          = I2C3_EV_IRQn,
                .IRQ_ER_n          = I2C3_ER_IRQn,
                .clk_src           = LL_RCC_I2C3_CLKSOURCE
        },
        #endif
        #if defined(RCC_APB1ENR_I2C4EN)
        {
                .I2C               = (I2C_TypeDef*)I2C4,
                .scl_freq          = __I2C4_SCL_FREQ__,
                .filter            = __I2C4_ANALOG_FILTER_DISABLE__ | ((__I2C4_DIGITAL_FILTER__ << I2C_CR1_DNF_Pos) & I2C_CR1_DNF),
                .scl_rise_time_ns  = __I2C4_SCL_RISE_TIME_ns__,
                .scl_fall_time_ns  = __I2C4_SCL_FALL_TIME_ns__,
                .data_hold_time_ns = __I2C4_DATA_HOLD_TIME_ns__,
                .data_setup_time_ns= __I2C4_DATA_SETUP_TIME_ns__,
                .APB1ENR_I2CEN     = RCC_APB1ENR_I2C4EN,
                .APB1RSTR_I2CRST   = RCC_APB1RSTR_I2C4RST,
                .IRQ_EV_n          = I2C4_EV_IRQn,
                .IRQ_ER_n          = I2C4_ER_IRQn,
                .clk_src           = LL_RCC_I2C4_CLKSOURCE
        },
        #endif
};

/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/
//==============================================================================
/**
 * @brief  Returns I2C address of current device
 * @param  hdl          device handle
 * @return I2C peripheral address
 */
//==============================================================================
static inline I2C_TypeDef *get_I2C(I2C_dev_t *hdl)
{
        return const_cast(I2C_TypeDef*, I2C_HW[hdl->major].I2C);
}

//==============================================================================
/**
 * @brief  Function handle error (try make the interface working)
 * @param  hdl          device handle
 */
//==============================================================================
static void reset(I2C_dev_t *hdl, bool reinit)
{
        printk("I2C%d:%d interface reset", hdl->major, hdl->minor);

        I2C_TypeDef *i2c = get_I2C(hdl);

        CLEAR_BIT(i2c->CR1, I2C_CR1_PE);

        if (reinit) {
                u16_t OAR1 = i2c->OAR1;
                _I2C_LLD__init(hdl->major);
                i2c->OAR1 = OAR1;
        }

        sys_sleep_ms(10);

        I2C_recovery_t *recovery = &_I2C[hdl->major]->recovery;

        if (recovery->enable) {
                i8_t state = _GPIO_DDI_get_pin(recovery->SDA.port_idx,
                                               recovery->SDA.pin_idx);
                int SCL_mode = 0;
                int err = _GPIO_DDI_get_pin_mode(recovery->SCL.port_idx,
                                                 recovery->SCL.pin_idx,
                                                 &SCL_mode);

                if (err) {
                        printk("I2C%d:%d invalid SCL pin - recovery skipped",
                               hdl->major, hdl->minor);
                }

                if ((state == 0) && (err == 0)) {
                        printk("I2C%d:%d detected SDA low - bus recovery",
                               hdl->major, hdl->minor);

                        #if defined(ARCH_stm32f3)
                        int mode = GPIO_MODE__OD;
                        #elif defined(ARCH_stm32f7)
                        int mode = GPIO_MODE__OD;
                        #endif
                        _GPIO_DDI_set_pin_mode(recovery->SCL.port_idx,
                                               recovery->SCL.pin_idx,
                                               mode);

                        for (int i = 0; i < 10; i++) {
                                _GPIO_DDI_clear_pin(recovery->SCL.port_idx,
                                                    recovery->SCL.pin_idx);
                                sys_sleep_ms(1);

                                _GPIO_DDI_set_pin(recovery->SCL.port_idx,
                                                  recovery->SCL.pin_idx);
                                sys_sleep_ms(1);
                        }

