devdnl/dnx-rtos/src/system/drivers/i2c/drv/STM32F3F7/i2c_lld.c
                        _GPIO_DDI_set_pin_mode(recovery->SCL.port_idx,
                                               recovery->SCL.pin_idx,
                                               SCL_mode);

                        state = _GPIO_DDI_get_pin(recovery->SDA.port_idx,
                                                  recovery->SDA.pin_idx);

                        printk("I2C%d:%d recovery %s", hdl->major, hdl->minor,
                               (state == 1) ? "success" : "fail");
                }
        }
}

//==============================================================================
/**
 * @brief  Function compute I2C timing.
 * @param  major        peripheral number
 * @param  timing       timing output
 */
//==============================================================================
static void compute_timing(u8_t major, i2c_timing_t *timing)
{
        u32_t fi2cclk = LL_RCC_GetI2CClockFreq(I2C_HW[major].clk_src);
        u32_t ti2cclk = DIV_ROUND_CLOSEST(NSEC_PER_SEC, fi2cclk);

        /*
         * Default configuration
         */
        timing->PRESC  = PRESC_MAX;
        timing->SCLL   = SCLL_MAX;
        timing->SCLH   = SCLH_MAX;
        timing->SCLDEL = 0;
        timing->SDADEL = 0;

        /*
         * Try calculate SCL timing value
         */
        bool found = false;
        for (u32_t presc = 1; (presc <= PRESC_MAX) && !found; presc++) {

                i32_t div = fi2cclk / presc / I2C_HW[major].scl_freq;

                if (div < 512) {

                        i32_t sync1_ticks = I2C_HW[major].scl_fall_time_ns / ti2cclk;
                        i32_t sync2_ticks = I2C_HW[major].scl_rise_time_ns / ti2cclk;

                        i32_t tsdadel = I2C_HW[major].data_hold_time_ns / ti2cclk;
                        i32_t tscldel = I2C_HW[major].data_setup_time_ns / ti2cclk;

                        timing->SCLDEL = min(15, tsdadel);
                        timing->SDADEL = min(15, tscldel);
                        timing->PRESC  = presc - 1;

                        if ((div / 2) - sync1_ticks - 1 >= 0) {
                                timing->SCLL = (div / 2) - 1 - sync1_ticks;
                        } else {
                                timing->SCLL = 0;
                        }

                        if ((div / 2) - 1 - sync2_ticks) {
                                timing->SCLH = (div / 2) - 1 - sync2_ticks;
                        } else {
                                timing->SCLH = 0;
                        }

                        printk("%s%d: target SCL frequency: %u Hz", GET_MODULE_NAME(), major,
                               fi2cclk / presc / div);

                        found = true;
                }
        }

        if (!found) {
                printk("%s%d: SCL frequency out of bound", GET_MODULE_NAME(), major);
        }
}

//==============================================================================
/**
 * @brief  Enables selected I2C peripheral according with configuration
 * @param  major        peripheral number
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__init(u8_t major)
{
        const I2C_info_t *cfg = &I2C_HW[major];
        I2C_TypeDef            *i2c = const_cast(I2C_TypeDef*, I2C_HW[major].I2C);

        CLEAR_BIT(RCC->APB1ENR, cfg->APB1ENR_I2CEN);
        SET_BIT(RCC->APB1ENR, cfg->APB1ENR_I2CEN);

        SET_BIT(RCC->APB1RSTR, cfg->APB1RSTR_I2CRST);
        sys_sleep_ms(10);
        CLEAR_BIT(RCC->APB1RSTR, cfg->APB1RSTR_I2CRST);

        NVIC_EnableIRQ(cfg->IRQ_EV_n);
        NVIC_EnableIRQ(cfg->IRQ_ER_n);
        NVIC_SetPriority(cfg->IRQ_EV_n, I2C_HW[major].IRQ_priority);
        NVIC_SetPriority(cfg->IRQ_ER_n, I2C_HW[major].IRQ_priority);

        CLEAR_BIT(i2c->CR1, I2C_CR1_PE);

        // Analog/digital filter
        CLEAR_BIT(i2c->CR1, I2C_CR1_ANFOFF | I2C_CR1_DNF);
        SET_BIT(i2c->CR1, cfg->filter);

        // SCL timing
        i2c_timing_t timing;
        compute_timing(major, &timing);

        i2c->TIMINGR = ((timing.PRESC << I2C_TIMINGR_PRESC_Pos) & I2C_TIMINGR_PRESC)
                     | ((timing.SCLDEL << I2C_TIMINGR_SCLDEL_Pos) & I2C_TIMINGR_SCLDEL)
                     | ((timing.SDADEL << I2C_TIMINGR_SDADEL_Pos) & I2C_TIMINGR_SDADEL)
                     | ((timing.SCLH << I2C_TIMINGR_SCLH_Pos) & I2C_TIMINGR_SCLH)
                     | ((timing.SCLL << I2C_TIMINGR_SCLL_Pos) & I2C_TIMINGR_SCLL);

        i2c->CR2 = 0;
        i2c->CR1 = I2C_CR1_PE;

        _I2C[major]->initialized = true;

        return 0;
}

//==============================================================================
/**
 * @brief  Disables selected I2C peripheral
 * @param  major        I2C peripheral number
 */
//==============================================================================
void _I2C_LLD__release(u8_t major)
{
        const I2C_info_t *cfg = &I2C_HW[major];
        I2C_TypeDef     *i2c = const_cast(I2C_TypeDef*, I2C_HW[major].I2C);

        NVIC_DisableIRQ(cfg->IRQ_EV_n);
        NVIC_DisableIRQ(cfg->IRQ_ER_n);

        WRITE_REG(i2c->CR1, 0);
        SET_BIT(RCC->APB1RSTR, cfg->APB1ENR_I2CEN);
        CLEAR_BIT(RCC->APB1RSTR, cfg->APB1ENR_I2CEN);
        CLEAR_BIT(RCC->APB1ENR, cfg->APB1ENR_I2CEN);

        _I2C[major]->initialized = false;
}

//==============================================================================
/**
 * @brief  Function generate START sequence on I2C bus
 * @param  hdl                  device handle
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__master_start(I2C_dev_t *hdl)
{
        UNUSED_ARG1(hdl);

        /*
         * Not used in this port. Everything is done in _I2C_LLD__master_transmit()
         * and _I2C_LLD__master_receive() functions.
         */

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function generate REPEAT START sequence on I2C bus
 * @param  hdl                  device handle
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__master_repeat_start(I2C_dev_t *hdl)
{
        UNUSED_ARG1(hdl);

