devdnl/dnx-rtos/src/system/drivers/i2c/drv/STM32F3F7/i2c_lld.c
        /*
         * Not used in this port. Everything is done in _I2C_LLD__master_transmit()
         * and _I2C_LLD__master_receive() functions.
         */

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function generate STOP sequence on I2C bus
 * @param  hdl                  device handle
 */
//==============================================================================
void _I2C_LLD__master_stop(I2C_dev_t *hdl)
{
        UNUSED_ARG1(hdl);

        /*
         * Not used in this port. Everything is done in _I2C_LLD__master_transmit()
         * and _I2C_LLD__master_receive() functions.
         */
}

//==============================================================================
/**
 * @brief  Function send I2C address sequence
 * @param  hdl                  device handle
 * @param  write                true: compose write address
 * @param  count                number of bytes to be written/read (in transfer).
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__master_send_address(I2C_dev_t *hdl, bool write, size_t count)
{
        UNUSED_ARG3(hdl, write, count);

        /*
         * Not used in this port. Everything is done in _I2C_LLD__master_transmit()
         * and _I2C_LLD__master_receive() functions.
         */

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function receive bytes from I2C bus (master-receiver)
 * @param  hdl                  device handle
 * @param  dst                  destination buffer
 * @param  count                number of bytes to receive
 * @param  rdcnt                number of read bytes
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__master_receive(I2C_dev_t *hdl, u8_t *dst, size_t count, size_t *rdcnt)
{
        int          err = EIO;
        I2C_TypeDef *i2c = get_I2C(hdl);

        /*
         * Disable transmission auto STOP.
         */
        CLEAR_BIT(i2c->CR2, I2C_CR2_AUTOEND);

        /*
         * Set I2C device address
         */
        CLEAR_BIT(i2c->CR2, I2C_CR2_SADD);
        SET_BIT(i2c->CR2, ((hdl->config.address & 0xFFFE) << I2C_CR2_SADD_Pos) & I2C_CR2_SADD);

        CLEAR_BIT(i2c->CR2, I2C_CR2_ADD10);
        if (hdl->config.addr_10bit) {
                SET_BIT(i2c->CR2, I2C_CR2_ADD10);
        }

        /*
         * Calculate transfer size. If subaddress is enabled then write transfer
         * is started first, then automatically repeat start is used to receive
         * selected amount of data (done in EV ISR).
         */
        size_t nbytes = 0;
        _I2C[hdl->major]->buf = dst;
        _I2C[hdl->major]->buf_len = count;
        _I2C[hdl->major]->subaddr_len = hdl->config.sub_addr_mode;
        _I2C[hdl->major]->subaddr_buf = _I2C[hdl->major]->subaddr;

        if (_I2C[hdl->major]->subaddr_len > 0) {
                /*
                 * The first transfer is subaddress.
                 * Switch peripheral to transmit mode.
                 */
                SET_BIT(i2c->CR1, I2C_CR1_ERRIE  | I2C_CR1_TCIE | I2C_CR1_STOPIE
                                | I2C_CR1_NACKIE | I2C_CR1_TXIE | I2C_CR1_RXIE);

                CLEAR_BIT(i2c->CR2, I2C_CR2_RD_WRN);

                _I2C[hdl->major]->restart_receive = true;

                nbytes = _I2C[hdl->major]->subaddr_len;

        } else {
                /*
                 * Subaddress is disabled, I2C will receive data directly.
                 * Swtich peripheral to receive mode.
                 */
                SET_BIT(i2c->CR1, I2C_CR1_ERRIE  | I2C_CR1_TCIE | I2C_CR1_STOPIE
                                | I2C_CR1_NACKIE | I2C_CR1_RXIE);

                SET_BIT(i2c->CR2, I2C_CR2_RD_WRN);

                _I2C[hdl->major]->restart_receive = true;

                nbytes = _I2C[hdl->major]->buf_len;
        }

        if (nbytes > MAX_TRANSFER_SIZE) {
                SET_BIT(i2c->CR2, I2C_CR2_RELOAD);
        } else {
                CLEAR_BIT(i2c->CR2, I2C_CR2_RELOAD);
        }

        CLEAR_BIT(i2c->CR2, I2C_CR2_NBYTES);
        SET_BIT(i2c->CR2, (min(MAX_TRANSFER_SIZE, nbytes) << I2C_CR2_NBYTES_Pos) & I2C_CR2_NBYTES);

        /*
         * Start I2C transmission
         */
        SET_BIT(i2c->CR2, I2C_CR2_START);

        /*
         * Wait for transaction to be finished.
         */
        u32_t event;
        err = sys_queue_receive(_I2C[hdl->major]->event, &event, I2C_TRANSFER_TIMEOUT);
        if (!err) {
                if (event & I2C_ISR_BERR) {
                        err = EFAULT;

                } else if (event & I2C_ISR_ARLO) {
                        err = EAGAIN;

                } else if (event & I2C_ISR_NACKF) {
                        err = ENODEV;

                } else if (event & I2C_ISR_STOPF) {
                        err = ESUCC;
                }

                if (!err) {
                        *rdcnt = count - _I2C[hdl->major]->buf_len;
                }
        } else {
                reset(hdl, false);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function transmit selected amount bytes to I2C bus
 * @param  hdl                  device handle
 * @param  src                  data source
 * @param  count                number of bytes to transfer
 * @param  wrcnt                number of written bytes
 * @param  subaddr              subaddress transfer
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__master_transmit(I2C_dev_t *hdl, const u8_t *src, size_t count, size_t *wrcnt, bool subaddr)
{
        int          err = EIO;
        I2C_TypeDef *i2c = get_I2C(hdl);

        /*
         * If transfer contains subaddress then remember it instead of transfer.
         */
        if (subaddr) {
                memset(_I2C[hdl->major]->subaddr, 0, sizeof(_I2C[hdl->major]->subaddr));
                memcpy(_I2C[hdl->major]->subaddr, src, count);
                return ESUCC;
        }

