devdnl/dnx-rtos/src/system/drivers/i2c/drv/STM32F3F7/i2c_lld.c
        _I2C[hdl->major]->restart_receive = false;

        /*
         * Set write mode and disable auto STOP.
         */
        CLEAR_BIT(i2c->CR2, I2C_CR2_RD_WRN | I2C_CR2_AUTOEND);

        /*
         * Set device address.
         */
        CLEAR_BIT(i2c->CR2, I2C_CR2_SADD);
        SET_BIT(i2c->CR2, ((hdl->config.address & 0xFFFE) << I2C_CR2_SADD_Pos) & I2C_CR2_SADD);

        CLEAR_BIT(i2c->CR2, I2C_CR2_ADD10);
        if (hdl->config.addr_10bit) {
                SET_BIT(i2c->CR2, I2C_CR2_ADD10);
        }

        /*
         * Configure transfer (number of bytes to send, IRQs, etc).
         */
        SET_BIT(i2c->CR1, I2C_CR1_ERRIE | I2C_CR1_TCIE | I2C_CR1_STOPIE | I2C_CR1_NACKIE | I2C_CR1_TXIE);

        _I2C[hdl->major]->buf = const_cast(u8_t*, src);
        _I2C[hdl->major]->buf_len = count;
        _I2C[hdl->major]->subaddr_len = hdl->config.sub_addr_mode;
        _I2C[hdl->major]->subaddr_buf = _I2C[hdl->major]->subaddr;

        size_t nbytes = _I2C[hdl->major]->buf_len + _I2C[hdl->major]->subaddr_len;
        if (nbytes > MAX_TRANSFER_SIZE) {
                SET_BIT(i2c->CR2, I2C_CR2_RELOAD);
        } else {
                CLEAR_BIT(i2c->CR2, I2C_CR2_RELOAD);
        }

        CLEAR_BIT(i2c->CR2, I2C_CR2_NBYTES);
        SET_BIT(i2c->CR2, (min(MAX_TRANSFER_SIZE, nbytes) << I2C_CR2_NBYTES_Pos) & I2C_CR2_NBYTES);

        /*
         * Start transfer.
         */
        SET_BIT(i2c->CR2, I2C_CR2_START);

        /*
         * Wait for transaction to be finished.
         */
        u32_t event;
        err = sys_queue_receive(_I2C[hdl->major]->event, &event, I2C_TRANSFER_TIMEOUT);
        if (!err) {
                if (event & I2C_ISR_BERR) {
                        err = EFAULT;

                } else if (event & I2C_ISR_ARLO) {
                        err = EAGAIN;

                } else if (event & I2C_ISR_NACKF) {
                        err = ENODEV;

                } else if (event & I2C_ISR_STOPF) {
                        err = ESUCC;
                }

                if (!err) {
                        *wrcnt = count - _I2C[hdl->major]->buf_len;
                }
        } else {
                reset(hdl, false);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function enable peripheral in slave mode.
 * @param  hdl                  device handle
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__slave_mode_setup(I2C_dev_t *hdl)
{
        I2C_TypeDef *i2c = get_I2C(hdl);

        if (hdl->config.mode == I2C_MODE__SLAVE) {

                i2c->OAR1 = (hdl->config.address & I2C_OAR1_OA1)
                          | (hdl->config.addr_10bit ? I2C_OAR1_OA1MODE : 0);

                i2c->OAR2 = 0;

                SET_BIT(i2c->OAR1, I2C_OAR1_OA1EN);
                SET_BIT(i2c->CR1, I2C_CR1_SBC | I2C_CR1_ADDRIE);

        } else {
                CLEAR_BIT(i2c->CR1, I2C_CR1_SBC | I2C_CR1_ADDRIE);
                i2c->OAR1 = 0;
                i2c->OAR2 = 0;
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function wait for I2C start/address condition event.
 * @param  hdl                  device handle
 * @param  event                event type and timeout
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__slave_wait_for_selection(I2C_dev_t *hdl, I2C_selection_t *event)
{
        u32_t ISR;
        int err = sys_queue_receive(_I2C[hdl->major]->event, &ISR, event->timeout_ms);
        if (!err) {
                if (ISR & I2C_ISR_ADDR) {
                        event->RD_addr = (ISR & I2C_ISR_DIR);
                } else {
                        err = EAGAIN;
                }
        } else {
                reset(hdl, false);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function transmit bytes to master device.
 * @param  hdl                  device handle
 * @param  src                  source buffer
 * @param  count                number of bytes to transfer
 * @param  wrctr                write counter
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__slave_transmit(I2C_dev_t *hdl, const u8_t *src, size_t count, size_t *wrctr)
{
        I2C_TypeDef *i2c = get_I2C(hdl);
        int    err = ESUCC;

        *wrctr = 0;

//        u32_t tref = sys_time_get_reference();
//
//        clear_address_event(hdl);
//
//        while (true) {
//                if ((i2c->SR1 & PI2C_SR1_TXE)) {
//                        if (count > 0) {
//                                i2c->DR = *src++;
//                                count--;
//                                (*wrctr)++;
//                        } else {
//                                i2c->DR = 0;
//                        }
//
//                } else if (sys_time_is_expired(tref, _I2C_DEVICE_TIMEOUT)) {
//                        printk("I2C%d: slave transmit timeout", hdl->major);
//                        _I2C_LLD__stop(hdl);
//                        err = ETIME;
//                        break;
//
//                } else {
//                        if (i2c->SR1 & PI2C_SR1_AF) {
//                                /*
//                                 * TXE flag is set always when shift buffer is
//                                 * empty. In this case CPU write next byte but
//                                 * there is possibility that there is a stop
//                                 * condition so written byte is not send to
//                                 * master device. In this case the number of
//                                 * sent bytes should be corrected by 1 byte.
//                                 */
//                                if (!(i2c->SR1 & PI2C_SR1_TXE)) {
//                                        if (*wrctr > 1) {
//                                                (*wrctr)--;
//                                        }
//                                }
//
//                                break;
//                        }
//                }
//        }
//
//        // clear AF flag
//        i2c->SR1 = 0;

