devdnl/dnx-rtos/src/system/drivers/i2c/drv/STM32F3F7/i2c_lld.c
        return err;
}

//==============================================================================
/**
 * @brief  Function receive bytes from master device.
 * @param  hdl                  device handle
 * @param  dst                  destination buffer
 * @param  count                number of bytes to transfer
 * @param  rdctr                read counter
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__slave_receive(I2C_dev_t *hdl, u8_t *dst, size_t count, size_t *rdctr)
{
        I2C_TypeDef *i2c = get_I2C(hdl);
        int    err = ESUCC;

        *rdctr = 0;

//        u32_t tref = sys_time_get_reference();
//
//        while (true) {
//                if (i2c->SR1 & PI2C_SR1_RXNE) {
//                        if (count > 0) {
//                                *dst++ = i2c->DR;
//                                count--;
//                                (*rdctr)++;
//                        } else {
//                                u8_t tmp = i2c->DR;
//                                (void)tmp;
//                        }
//
//                } else if (sys_time_is_expired(tref, _I2C_DEVICE_TIMEOUT)) {
//                        printk("I2C%d: slave receive timeout", hdl->major);
//                        _I2C_LLD__stop(hdl);
//                        err = ETIME;
//                        break;
//
//                } else {
//                        if (i2c->SR1 & (PI2C_SR1_ADDR | PI2C_SR1_STOPF)) {
//                                if (i2c->SR1 & PI2C_SR1_RXNE) {
//                                       if (count > 0) {
//                                               *dst++ = i2c->DR;
//                                               count--;
//                                               (*rdctr)++;
//                                       } else {
//                                               u8_t tmp = i2c->DR;
//                                               (void)tmp;
//                                       }
//
//                                }
//                                break;
//                        }
//                }
//                sys_sleep_ms(1);
//        }
//
//        // clear STOPF flag
//        sys_critical_section_begin();
//        {
//                u8_t tmp = i2c->SR1;
//                (void)tmp;
//                SET_BIT(i2c->CR1, PI2C_CR1_PE);
//        }
//        sys_critical_section_end();

        return err;
}

//==============================================================================
/**
 * @brief  Event IRQ handler (transaction state machine)
 * @param  major        number of peripheral
 */
//==============================================================================
static void IRQ_EV_handler(u8_t major)
{
        bool woken = false;

        I2C_TypeDef *i2c = const_cast(I2C_TypeDef*, I2C_HW[major].I2C);
        u16_t  ISR = i2c->ISR;

        /*
         * Handle slave NACK response.
         */
        if (ISR & I2C_ISR_NACKF) {
                WRITE_REG(i2c->ICR, I2C_ICR_NACKCF);
                u32_t event = I2C_ISR_NACKF;
                sys_queue_send_from_ISR(_I2C[major]->event, &event, &woken);
        }

        /*
         * Handle Tx register empty.
         */
        if (ISR & I2C_ISR_TXIS) {
                u8_t byte;

                if (_I2C[major]->subaddr_len > 0) {
                        byte = *_I2C[major]->subaddr_buf++;
                        _I2C[major]->subaddr_len--;

                } else if (_I2C[major]->buf_len > 0) {
                        byte = *_I2C[major]->buf++;
                        _I2C[major]->buf_len--;
                } else {
                        byte = 0;
                }

                i2c->TXDR = byte;
        }

        /*
         * Handle Rx register not empty.
         */
        if (ISR & I2C_ISR_RXNE) {
                u8_t byte = i2c->RXDR;

                if (_I2C[major]->buf_len > 0) {
                        *_I2C[major]->buf++ = byte;
                        _I2C[major]->buf_len--;
                }
        }

        /*
         * Handle transfer complete reload. This flag is set when NBYTES field
         * is 0. Flag setup new amount of data to be send.
         */
        if (ISR & I2C_ISR_TCR) {

                CLEAR_BIT(i2c->CR2, I2C_CR2_RELOAD);
                CLEAR_BIT(i2c->CR2, I2C_CR2_NBYTES);

                size_t nbytes = _I2C[major]->buf_len;
                if (nbytes > MAX_TRANSFER_SIZE) {
                        SET_BIT(i2c->CR2, I2C_CR2_RELOAD);
                }

                SET_BIT(i2c->CR2, (min(MAX_TRANSFER_SIZE, nbytes) << I2C_CR2_NBYTES_Pos) & I2C_CR2_NBYTES);
        }

        /*
         * Handle transfer complete. Flag is set when transfer tx/rx is complete.
         */
        if (ISR & I2C_ISR_TC) {

                if (_I2C[major]->restart_receive) {
                        /*
                         * Restart-receive operation requested (after subaddress
                         * send).
                         */
                        _I2C[major]->restart_receive = false;
                        CLEAR_BIT(i2c->CR1, I2C_CR1_TXIE);

                        SET_BIT(i2c->CR2, I2C_CR2_RD_WRN);

                        size_t nbytes = _I2C[major]->buf_len;
                        if (nbytes > MAX_TRANSFER_SIZE) {
                                SET_BIT(i2c->CR2, I2C_CR2_RELOAD);
                        } else {
                                CLEAR_BIT(i2c->CR2, I2C_CR2_RELOAD);
                        }

                        SET_BIT(i2c->CR2, I2C_CR2_START);
                } else {
                        /*
                         * Transfer finished, stop request.
                         */
                        SET_BIT(i2c->CR2, I2C_CR2_STOP);
                }
        }

        /*
         * STOP signal generated. After this operation entire transfer is complete.
         */
        if (ISR & I2C_ISR_STOPF) {
                WRITE_REG(i2c->ICR, I2C_ICR_STOPCF);

                CLEAR_BIT(i2c->CR1, I2C_CR1_ERRIE | I2C_CR1_TCIE | I2C_CR1_STOPIE | I2C_CR1_NACKIE | I2C_CR1_TXIE);

                u32_t event = I2C_ISR_STOPF;
                sys_queue_send_from_ISR(_I2C[major]->event, &event, &woken);
        }

