devdnl/dnx-rtos/src/system/drivers/i2c/drv/STM32F3F7/i2c_lld.c
        /*
         * Handle adress selection flag.
         */
        if (ISR & I2C_ISR_ADDR) {
                u32_t event = ISR & (I2C_ISR_ADDR | I2C_ISR_DIR);
                sys_queue_send_from_ISR(_I2C[major]->event, &event, &woken);
        }

        sys_thread_yield_from_ISR(woken);
}

//==============================================================================
/**
 * @brief  Error IRQ handler
 * @param  major        number of peripheral
 */
//==============================================================================
static void IRQ_ER_handler(u8_t major)
{
        bool woken = false;

        I2C_TypeDef *i2c = const_cast(I2C_TypeDef*, I2C_HW[major].I2C);
        u16_t ISR = i2c->ISR;

        if (ISR & ( I2C_ISR_BERR    | I2C_ISR_OVR   | I2C_ISR_ARLO
                  | I2C_ISR_TIMEOUT | I2C_ISR_ALERT | I2C_ISR_PECERR)) {

                u32_t event = ISR;
                sys_queue_send_from_ISR(_I2C[major]->event, &event, &woken);
        }

        WRITE_REG(i2c->ICR, I2C_ICR_BERRCF   | I2C_ICR_OVRCF    | I2C_ICR_ARLOCF
                          | I2C_ICR_TIMOUTCF | I2C_ICR_ALERTCF  | I2C_ICR_PECCF);

        sys_thread_yield_from_ISR(woken);
}

//==============================================================================
/**
 * @brief  I2C1 Event IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C1EN)
void I2C1_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C1 Error IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C1EN)
void I2C1_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C1);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Event IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C2EN)
void I2C2_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Error IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C2EN)
void I2C2_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C2);
}
#endif

//==============================================================================
/**
 * @brief  I2C3 Event IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C3EN)
void I2C3_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C3);
}
#endif

//==============================================================================
/**
 * @brief  I2C3 Error IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C3EN)
void I2C3_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C3);
}
#endif

//==============================================================================
/**
 * @brief  I2C4 Event IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C4EN)
void I2C4_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C4);
}
#endif

//==============================================================================
/**
 * @brief  I2C4 Error IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_I2C4EN)
void I2C4_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C4);
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
